Revit 2027 API
TableSectionData.MergeCells Method
 Merges cells for the given area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MergeCells(
	TableMergedCell mergedCell
)
Public Sub MergeCells (
	mergedCell As TableMergedCell
)
public:
void MergeCells(
	TableMergedCell^ mergedCell
)
member MergeCells :
        mergedCell : TableMergedCell -> unit
Parameters
mergedCell TableMergedCell
Exceptions
Exception | Condition
ArgumentException |  The given TableMergedCell mergedCell is outside of acceptable range.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace